spec/fixtures/soap/xml/IControl.LocalLB.VirtualServer_before_vlan_change.set_vlan_request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="urn:iControl:LocalLB/VirtualServer"><env:Body><wsdl:set_vlan><virtual_servers><item>test_virtual_server_nil</item></virtual_servers><vlans><item><state>STATE_ENABLED</state><vlans><item1>test_vlan1</item1><item2>test_vlan2</item2></vlans></item></vlans></wsdl:set_vlan></env:Body></env:Envelope>